In [178]:
import pandas as pd

## 2.1  Step 1. Open the data file and have a look at the general information.

In [179]:
try:
    df = pd.read_csv('credit_scoring_eng.csv')
except:
     df = pd.read_csv('/datasets/credit_scoring_eng.csv')

df.head(100)
#the 20 first lines loads successfully

,children,days_employed,dob_years,education,education_id,family_status,family_status_id,gender,income_type,debt,total_income,purpose
0,1,-8437.673028,42,bachelor's degree,0,married,0,F,employee,0,40620.102,purchase of the house
1,1,-4024.803754,36,secondary education,1,married,0,F,employee,0,17932.802,car purchase
2,0,-5623.422610,33,Secondary Education,1,married,0,M,employee,0,23341.752,purchase of the house
3,3,-4124.747207,32,secondary education,1,married,0,M,employee,0,42820.568,supplementary education
4,0,340266.072047,53,secondary education,1,civil partnership,1,F,retiree,0,25378.572,to have a wedding
...,...,...,...,...,...,...,...,...,...,...,...,...
95,0,-541.832241,51,bachelor's degree,0,married,0,F,employee,0,15070.060,car
96,0,NaN,44,SECONDARY EDUCATION,1,married,0,F,employee,0,NaN,buy residential real estate
97,0,NaN,47,bachelor's degree,0,married,0,F,employee,0,NaN,profile education
98,0,364906.205736,54,bachelor's degree,0,married,0,F,retiree,0,31953.168,buying property for renting out
99,0,346541.618895,0,Secondary Education,1,married,0,F,retiree,0,11406.644,car

In [180]:
df.info()
#What instantly catches the attention is the altered number of days_employed and total_income columns. This needs to be investigated

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 21525 entries, 0 to 21524
Data columns (total 12 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   children          21525 non-null  int64
 1   days_employed     19351 non-null  float64
 2   dob_years         21525 non-null  int64
 3   education         21525 non-null  object
 4   education_id      21525 non-null  int64
 5   family_status     21525 non-null  object
 6   family_status_id  21525 non-null  int64
 7   gender            21525 non-null  object
 8   income_type       21525 non-null  object
 9   debt              21525 non-null  int64
 10  total_income      19351 non-null  float64
 11  purpose           21525 non-null  object
dtypes: float64(2), int64(5), object(5)
memory usage: 2.0+ MB

# 2.4 Step 2: Data preprocessing

## 2.5 Processing missing values

In [181]:
df.isnull().sum()

#counts missing values for days_employed and total_income

children               0
days_employed       2174
dob_years              0
education              0
education_id           0
family_status          0
family_status_id       0
gender                 0
income_type            0
debt                   0
total_income        2174
purpose                0
dtype: int64

## 2.8  Data type replacement

In [182]:
total_income_mean = df['total_income'].mean()
#mean value from total_income column retrieved

In [183]:
df['total_income'].fillna(value=total_income_mean, inplace=True)
#total_income NaN values filled with mean value

df['days_employed'].fillna(value=0, inplace=True)
#not possible to retrieve a mean realistic therefore NaN values were replaced by 0.

In [184]:
df['days_employed'] = df['days_employed'].astype(int)
df['total_income'] = df['total_income'].astype(int)
df.info()
#both columns values converted to Integers to match the rest of the table.

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 21525 entries, 0 to 21524
Data columns (total 12 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   children          21525 non-null  int64
 1   days_employed     21525 non-null  int64
 2   dob_years         21525 non-null  int64
 3   education         21525 non-null  object
 4   education_id      21525 non-null  int64
 5   family_status     21525 non-null  object
 6   family_status_id  21525 non-null  int64
 7   gender            21525 non-null  object
 8   income_type       21525 non-null  object
 9   debt              21525 non-null  int64
 10  total_income      21525 non-null  int64
 11  purpose           21525 non-null  object
dtypes: int64(7), object(5)
memory usage: 2.0+ MB

In [185]:
df['education'] = df['education'].str.lower()
#turns all of the education columns's values in lowercase to facilitate the duplicate count in the next step

## 2.12  Processing duplicates

#### Duplicates were removed after the first exercise of number 3 of this project

In [186]:
df['education'].unique()
#checking if there is some values left or corrupted in the column

array(["bachelor's degree", 'secondary education', 'some college',
       'primary education', 'graduate degree'], dtype=object)

In [187]:
df['purpose'].unique()
#checking for duplicates/similar names that can be condensed in less categories

array(['purchase of the house', 'car purchase', 'supplementary education',
       'to have a wedding', 'housing transactions', 'education',
       'having a wedding', 'purchase of the house for my family',
       'buy real estate', 'buy commercial real estate',
       'buy residential real estate', 'construction of own property',
       'property', 'building a property', 'buying a second-hand car',
       'buying my own car', 'transactions with commercial real estate',
       'building a real estate', 'housing',
       'transactions with my real estate', 'cars', 'to become educated',
       'second-hand car purchase', 'getting an education', 'car',
       'wedding ceremony', 'to get a supplementary education',
       'purchase of my own house', 'real estate transactions',
       'getting higher education', 'to own a car', 'purchase of a car',
       'profile education', 'university education',
       'buying property for renting out', 'to buy a car',
       'housing renovation', 'going to university'], dtype=object)

## 2.15  Categorizing Data

In [188]:
def purpose_categories(purpose):
    if 'car' in purpose:
        return "Car"
    if 'education' in purpose:
        return 'Education'
    if 'wedding' in purpose:
        return 'Wedding'
    elif 'property' or 'real estate' or 'hous'in purpose:
        return 'Property & Real Estate'

df['purpose_categories'] = df['purpose'].apply(purpose_categories)
df['purpose_categories'].value_counts()

#purpose column categorized into 4 columns:
#property & real estate, car, education and wedding

Property & Real Estate    11748
Car                        4315
Education                  3114
Wedding                    2348
Name: purpose_categories, dtype: int64

In [189]:
df = df.drop(columns=['purpose'], axis = 1) 
#purpose columns is replaced by categorized purposes label 'purpose'.

### Data Categorization (Income Type and Total Income columns)

In [190]:
df['income_type'].unique()
#must be categorized

array(['employee', 'retiree', 'business', 'civil servant', 'unemployed',
       'entrepreneur', 'student', 'paternity / maternity leave'],
      dtype=object)

In [191]:
df['income_levels'] = pd.qcut(df['total_income'], q=8, precision=0)
df.head()
#the total_income column were divided into 8 different quartiles, each one assigned an interval related to income_type values

,children,days_employed,dob_years,education,education_id,family_status,family_status_id,gender,income_type,debt,total_income,purpose_categories,income_levels
0,1,-8437,42,bachelor's degree,0,married,0,F,employee,0,40620,Property & Real Estate,"(31286.0, 40639.0]"
1,1,-4024,36,secondary education,1,married,0,F,employee,0,17932,Car,"(17247.0, 20978.0]"
2,0,-5623,33,secondary education,1,married,0,M,employee,0,23341,Property & Real Estate,"(20978.0, 25024.0]"
3,3,-4124,32,secondary education,1,married,0,M,employee,0,42820,Education,"(40639.0, 362496.0]"
4,0,340266,53,secondary education,1,civil partnership,1,F,retiree,0,25378,Wedding,"(25024.0, 26787.0]"

In [192]:
df['income_categories'] = pd.qcut(df['total_income'], q=8, precision=0, labels=['Category 1', 'Category 2','Category 3','Category 4','Category 5','Category 6','Category 7','Category 8',])
df.head()
#income categories simply gives a label to the intervals, making it easy to understand which income type refers to which interval of income.

,children,days_employed,dob_years,education,education_id,family_status,family_status_id,gender,income_type,debt,total_income,purpose_categories,income_levels,income_categories
0,1,-8437,42,bachelor's degree,0,married,0,F,employee,0,40620,Property & Real Estate,"(31286.0, 40639.0]",Category 7
1,1,-4024,36,secondary education,1,married,0,F,employee,0,17932,Car,"(17247.0, 20978.0]",Category 3
2,0,-5623,33,secondary education,1,married,0,M,employee,0,23341,Property & Real Estate,"(20978.0, 25024.0]",Category 4
3,3,-4124,32,secondary education,1,married,0,M,employee,0,42820,Education,"(40639.0, 362496.0]",Category 8
4,0,340266,53,secondary education,1,civil partnership,1,F,retiree,0,25378,Wedding,"(25024.0, 26787.0]",Category 5

In [193]:
df.groupby('income_categories')['income_levels'].value_counts()
#easier to relate the income amounts with the categories

income_categories  income_levels
Category 1         (3305.0, 13430.0]      2692
Category 2         (13430.0, 17247.0]     2690
Category 3         (17247.0, 20978.0]     2690
Category 4         (20978.0, 25024.0]     2692
Category 5         (25024.0, 26787.0]     3302
Category 6         (26787.0, 31286.0]     2078
Category 7         (31286.0, 40639.0]     2690
Category 8         (40639.0, 362496.0]    2691
Name: income_levels, dtype: int64

In [194]:
income_stats = df.pivot_table(index='income_categories', values='income_levels', columns='income_type', aggfunc='count')
# pivot table created to show how much of each type of income are in every interval of salary.

income_stats.fillna(value=0, inplace=True)
#NaN values replaced by 0. They play no roles in the table.
income_stats = income_stats.astype(int)
#all float numbers changed to integer
income_stats

income_type,business,civil servant,employee,entrepreneur,paternity / maternity leave,retiree,student,unemployed
income_categories,,,,,,,,
Category 1,278,168,1362,0,1,882,0,1
Category 2,474,184,1459,0,0,572,1,0
Category 3,526,168,1483,0,0,513,0,0
Category 4,602,177,1491,0,0,422,0,0
Category 5,799,221,1701,1,0,580,0,0
Category 6,561,149,1078,0,0,290,0,0
Category 7,790,195,1383,0,0,321,0,1
Category 8,1055,197,1162,1,0,276,0,0

# 2.19  Step 3. Answer these questions

## Is there a relation between having kids and repaying a loan on time?

In [195]:
df['children'] = df['children'].replace(to_replace= -1, value=0)
#in the children column, the value = 1 were replaced by 0, no children at all.
df['children'] = df['children'].replace(to_replace= 20, value=0)
#in the children column, the value = 20 were replaced by 2, no children at all.

#in my understanding, the -1 might be a random value (MCAR). I wasn't able to assign any other meaning, even comparing to the rest of the table. therefore I replaced with 0, not having any impact in the table at all.
#similar happens to the 20 (MAR) value. this time I would consider it a typo, which makes more sense and replaced it to only 2 children.

In [196]:
df.duplicated().sum()
#426 duplicates were find

df = df.drop_duplicates().reset_index(drop=True)
#duplicated data was deleted and index reseted

df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 21096 entries, 0 to 21095
Data columns (total 14 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   children            21096 non-null  int64
 1   days_employed       21096 non-null  int64
 2   dob_years           21096 non-null  int64
 3   education           21096 non-null  object
 4   education_id        21096 non-null  int64
 5   family_status       21096 non-null  object
 6   family_status_id    21096 non-null  int64
 7   gender              21096 non-null  object
 8   income_type         21096 non-null  object
 9   debt                21096 non-null  int64
 10  total_income        21096 non-null  int64
 11  purpose_categories  21096 non-null  object
 12  income_levels       21096 non-null  category
 13  income_categories   21096 non-null  category
dtypes: category(2), int64(7), object(5)
memory usage: 2.0+ MB

In [197]:
def have_children(children):
        if children != 0:
            return 'Yes'
        else:
            return 'No'

df['have_children'] = df['children'].apply(have_children)
df['have_children'].value_counts()
#not exactly a necessary column. however, is helpful to the next block of code.

No     13936
Yes     7160
Name: have_children, dtype: int64

In [228]:
ratio = pd.DataFrame(df.groupby('have_children')['debt'].value_counts() / len(df) * 100)# in % 
ratio.round(2)

#I'm really having difficulties developing a table with the below values. I know is not what was asked, but I need a feedback with some sort of help.

#However, the values on the right means the percentage (correlation) between having children and having debts. Therefore, we can conclude that only 3% of the whole list of clients with children have debts. In contrary, not having children increases in around 2% the chance of not paying the loan.

                     debt
have_children debt
No            0     60.99
              1      5.07
Yes           0     30.77
              1      3.17

## Is there a relation between marital status and repaying a loan on time?

In [229]:
marital_status = pd.DataFrame(df.groupby('family_status')['debt'].value_counts() / len(df) * 100) # in %
marital_status.round(2)

#the same logic that is applied to the above question.
#what catches the attention at first is the high number of married people and civil partners that don't have debts and covers almost 70% of the list.

                         debt
family_status     debt
civil partnership 0     17.71
                  1      1.84
divorced          0      5.25
                  1      0.40
married           0     52.74
                  1      4.40
unmarried         0     11.89
                  1      1.30
widow / widower   0      4.17
                  1      0.30

## Is there a relation between income level and repaying a loan on time?

In [233]:
income_loan = pd.DataFrame(df.groupby(['income_categories', 'income_levels'])['debt'].value_counts() / len(df) * 100) # in %
income_loan.round(2)

#same as above
#almost all categories of incoming levels has a very low ratio of defaulting clientes, around  1%.

                                             debt
income_categories income_levels       debt
Category 1        (3305.0, 13430.0]   0     11.78
                                      1      0.98
Category 2        (13430.0, 17247.0]  0     11.70
                                      1      1.05
Category 3        (17247.0, 20978.0]  0     11.67
                                      1      1.09
Category 4        (20978.0, 25024.0]  0     11.60
                                      1      1.16
Category 5        (25024.0, 26787.0]  0     12.33
                                      1      1.28
Category 6        (26787.0, 31286.0]  0      8.99
                                      1      0.86
Category 7        (31286.0, 40639.0]  0     11.80
                                      1      0.95
Category 8        (40639.0, 362496.0] 0     11.87
                                      1      0.88

How do different loan purposes affect on-time repayment of the loan?

In [236]:
purposes = pd.DataFrame(df.groupby('purpose_categories')['debt'].value_counts() / len(df) * 100) # in %
purposes.round(2)income_loan = pd.DataFrame(df.groupby(['income_categories', 'income_levels'])['debt'].value_counts() / len(df) * 100)
income_loan.round(2)

                              debt
purpose_categories     debt
Car                    0     18.34
                       1      1.91
Education              0     13.26
                       1      1.37
Property & Real Estate 0     50.11
                       1      4.09
Wedding                0     10.05
                       1      0.88

# OVERALL CONCLUSION

In [239]:
overall = pd.DataFrame(df.groupby('debt').count() / len(df) * 100) # in %
overall.round(2)

,children,days_employed,dob_years,education,education_id,family_status,family_status_id,gender,income_type,total_income,purpose_categories,income_levels,income_categories,have_children,ratio
debt,,,,,,,,,,,,,,,
0,91.76,91.76,91.76,91.76,91.76,91.76,91.76,91.76,91.76,91.76,91.76,91.76,91.76,91.76,91.76
1,8.24,8.24,8.24,8.24,8.24,8.24,8.24,8.24,8.24,8.24,8.24,8.24,8.24,8.24,8.24

In [ ]:
### To conclude, after all calculations and table divisions, the goal was achieved: in average, only 8% of the customers of the whole list have debts. However, this number must be examined in details, as I did in the last 4 tables above.

###The group with the higher risk of defaulting clients is the one of MARRIED PEOPLE WITHOUT CHILDREN. together, 9% of them doesn't pay their loans in time. I would say that to this group of people, the bank should be more careful when allowing then a loan.

###There were some typos and missing values in the original files which coud lead to misunderstandings in the children, education, total_income and purpose_categories columns. Therefore, a .lower() method as well as mean() methods and fillna()were necessary o standardize data.